In [1]:
import pandas as pd

In [5]:
df = pd.read_csv("Affairs.csv")

In [6]:
df.head(5)

,Unnamed: 0,affairs,gender,age,yearsmarried,children,religiousness,education,occupation,rating
0,4,0,male,37.0,10.00,no,3,18,7,4
1,5,0,female,27.0,4.00,no,4,14,6,4
2,11,0,female,32.0,15.00,yes,1,12,1,4
3,16,0,male,57.0,15.00,yes,5,18,6,5
4,23,0,male,22.0,0.75,no,2,17,6,3

In [7]:
df["age"].unique()

array([37. , 27. , 32. , 57. , 22. , 47. , 42. , 52. , 17.5])

In [8]:
df["affairs"].unique()

array([ 0,  3,  7, 12,  1,  2])

In [9]:
df["rating"].unique()

array([4, 5, 3, 2, 1])

In [10]:
df["rating"]>2

0       True
1       True
2       True
3       True
4       True
       ...
596     True
597     True
598     True
599    False
600     True
Name: rating, Length: 601, dtype: bool

In [11]:
df1 = df[df["rating"]>2]

In [12]:
df1.head(5)

,Unnamed: 0,affairs,gender,age,yearsmarried,children,religiousness,education,occupation,rating
0,4,0,male,37.0,10.00,no,3,18,7,4
1,5,0,female,27.0,4.00,no,4,14,6,4
2,11,0,female,32.0,15.00,yes,1,12,1,4
3,16,0,male,57.0,15.00,yes,5,18,6,5
4,23,0,male,22.0,0.75,no,2,17,6,3

In [13]:
df3 = df1[df1["rating"]>3]

In [14]:
print(df3)

     Unnamed: 0  affairs  gender   age  yearsmarried children  religiousness  \
0             4        0    male  37.0          10.0       no              3
1             5        0  female  27.0           4.0       no              4
2            11        0  female  32.0          15.0      yes              1
3            16        0    male  57.0          15.0      yes              5
5            29        0  female  32.0           1.5       no              2
..          ...      ...     ...   ...           ...      ...            ...
593        1876       12    male  27.0           7.0      yes              2
596        1938        1    male  22.0           1.5      yes              1
597        1941        7  female  32.0          10.0      yes              2
598        1954        2    male  32.0          10.0      yes              2
600        9010        1  female  32.0          15.0      yes              3

     education  occupation  rating
0           18           7       4
1           14           6       4
2           12           1       4
3           18           6       5
5           17           5       5
..         ...         ...     ...
593         17           5       4
596         12           2       5
597         18           5       4
598         17           6       5
600         14           1       5

[426 rows x 10 columns]

In [16]:
df3.tail()

,Unnamed: 0,affairs,gender,age,yearsmarried,children,religiousness,education,occupation,rating
593,1876,12,male,27.0,7.0,yes,2,17,5,4
596,1938,1,male,22.0,1.5,yes,1,12,2,5
597,1941,7,female,32.0,10.0,yes,2,18,5,4
598,1954,2,male,32.0,10.0,yes,2,17,6,5
600,9010,1,female,32.0,15.0,yes,3,14,1,5